mock-example/src/test/resources/xml/ECH/getCreditHistoryScoring/rq2.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
   <soap:Header>
      <mq:AsyncHeader xmlns:mq="http://sbrf.ru/prpc/mq/headers">
         <mq:message-id>message-id</mq:message-id>
         <mq:request-time>2014-12-16T17:55:06.410+04:00</mq:request-time>
         <mq:operation-name>SrvGetCreditHistoryScoringRs</mq:operation-name>
      </mq:AsyncHeader>
   </soap:Header>
   <soap:Body>
      <ECH:SrvGetCreditHistoryScoringRq xmlns:ECH="http://sbrf.ru/prpc/ech/10"
                                        xmlns:tns="http://www.sbrf.ru/CreditHistoryScoring">
         <tns:checkInternal>test1</tns:checkInternal>
         <!--from 1 to 1 elements --><tns:checkExternal>false</tns:checkExternal>
         <!--from 1 to 1 elements --><tns:participants><!--from 1 to unbounded elements --><tns:participant><!--from 1 to 1 elements --><tns:index>10</tns:index>
               <!--from 1 to 1 elements --><tns:role>0</tns:role>
               <!--from 1 to 1 elements --><tns:status>0</tns:status>
               <!--from 1 to 1 elements --><tns:gslStatus>0</tns:gslStatus>
               <!--from 1 to 1 elements --><tns:kgStatus>0</tns:kgStatus>
            </tns:participant>
         </tns:participants>
      </ECH:SrvGetCreditHistoryScoringRq>
   </soap:Body>
</soap:Envelope>
